Repository: iKorunny/LidaChallenges
Catalog: LidaChallenges/LidaChallenges/*.lproj/Localizable.strings
Languages: ru

# ChallengeWaterNormDescription
source: Drinking enough water every day has many health benefits. Here are some of them: 1. Hydration: Water maintains normal hydration levels, which is necessary for all bodily functions. 2. Regulates body temperature: Water helps maintain optimal body temperature, especially during physical activity or in hot weather. 3. Improves digestion: Adequate water promotes normal digestion, preventing constipation and facilitating the absorption of nutrients. 4. Supports kidney function: Water helps remove toxins and waste from the body, maintaining kidney health and preventing the formation of stones. 5. Improves skin health: Good hydration helps improve the condition of the skin, making it firmer and healthier. 6. Reduces hunger: Sometimes thirst can be perceived as hunger. Drinking water can help control appetite and reduce calorie intake. 7. Supports cardiovascular health: Water helps maintain normal blood volume and improves circulation, which is important for heart health. 8. Improves physical performance: Adequate hydration is important for maintaining energy and endurance during physical activity. 9. Supports cognitive function: Not drinking enough water can lead to poor concentration, memory, and overall cognitive function. 10. Reduces the risk of disease: Good hydration can help reduce the risk of developing certain diseases, such as urinary tract infections and kidney stones. 11. Improves mood: Adequate water can help improve mood and reduce stress levels. 12. Supports joint health: Water helps lubricate joints, which can reduce the risk of injury and improve mobility. How much water to drink The recommended amount of water may vary depending on age, gender, level of physical activity, and climate conditions. There are two indicators to pay attention to: thirst and the color of urine. If you are thirsty - drink more. If your urine is dark - drink more. It is important to listen to your body.
ru: Употребление достаточного количества воды каждый день имеет множество преимуществ для здоровья. Вот некоторые из них: 1. Гидратация: Вода поддерживает нормальный уровень гидратации, что необходимо для всех функций организма. 2. Регуляция температуры тела: Вода помогает поддерживать оптимальную температуру тела, особенно во время физической активности или в жаркую погоду. 3. Улучшение пищеварения: Достаточное количество воды способствует нормальному пищеварению, предотвращая запоры и способствуя усвоению питательных веществ. 4. Поддержка работы почек: Вода помогает выводить токсины и шлаки из организма, поддерживая здоровье почек и предотвращая образование камней. 5. Улучшение состояния кожи: Хорошая гидратация способствует улучшению состояния кожи, делая ее более упругой и здоровой. 6. Снижение чувства голода: Иногда жажда может восприниматься как голод. Употребление воды может помочь контролировать аппетит и снизить потребление калорий. 7. Поддержка сердечно-сосудистой системы: Вода помогает поддерживать нормальный объем крови и улучшает циркуляцию, что важно для здоровья сердца. 8. Улучшение физической работоспособности: Достаточная гидратация важна для поддержания энергии и выносливости во время физической активности. 9. Поддержка когнитивных функций: Недостаток воды может привести к ухудшению концентрации, памяти и общего когнитивного функционирования. 10. Снижение риска заболеваний: Хорошая гидратация может помочь снизить риск развития некоторых заболеваний, таких как инфекции мочевыводящих путей и камни в почках. 11. Улучшение настроения: Достаточное количество воды может способствовать улучшению настроения и снижению уровня стресса. 12. Поддержка здоровья суставов: Вода помогает смазывать суставы, что может снизить риск травм и улучшить подвижность. Норма воды Рекомендуемая норма потребления воды может варьироваться в зависимости от возраста, пола, уровня физической активности и климатических условий. Обращать внимание нужно на 2 показателя: жажда и цвет мочи. Если вы испытываете жажду - пейте больше. Если Ваш цвет мочи темный - пейте больше. Важно прислушиваться к своему организму.

# ChallengeBalancedFoodMonthTitle
source: 30 days of balanced nutrition
ru: 30 дней сбалансированного питания

# ChallengeBalancedFoodMonthSubtitle
source: "30 days of healthy and balanced food"
ru: "30 дней питайся здоровой и сбалансированной едой"

# ChallengeBalancedFoodMonthDescription
source: A balanced diet has many benefits for your health and overall well-being. Here are some of them: 1. Maintains Health: A balanced diet provides the body with all the necessary nutrients, vitamins, and minerals, which helps maintain overall health. 2. Weight Management: A healthy diet helps control weight, preventing both overweight and underweight. 3. Improves Digestion: A balanced diet rich in fiber (vegetables, fruits, whole grains) helps normalize bowel movements and prevents constipation. 4. Reduces the Risk of Chronic Disease: A healthy diet can reduce the risk of developing heart disease, type 2 diabetes, certain cancers, and other chronic diseases. 5. Improves Energy Levels: A balanced diet provides the body with the calories and nutrients it needs, which helps increase energy levels and improve performance. 6. Supports the immune system: The vitamins and minerals found in a balanced diet help strengthen the immune system and protect the body from infections. 7. Improves skin and hair: Eating right can help improve the condition of your skin and hair, making them healthier and more beautiful. 8. Supports mental health: Some studies suggest that a balanced diet can help improve your mood and reduce the risk of depression and anxiety. 9. Improves cognitive function: Nutrients such as omega-3 fatty acids, B vitamins, and antioxidants can support brain health and improve memory and concentration. 10. Reduces stress: Eating right can help the body cope better with stress and improve overall well-being. 11. Supports bone and dental health: Calcium and vitamin D found in a balanced diet are important for healthy bones and teeth. 12. Improves sleep: Certain foods, such as nuts, bananas, and dairy products, can help improve the quality of your sleep. 13. Longevity: A balanced diet can help increase life expectancy and improve the quality of life. A balanced diet includes a variety of foods from all food groups: fruits, vegetables, whole grains, protein (meat, fish, legumes) and healthy fats. This helps provide the body with all the nutrients it needs to maintain health and well-being.
ru: Сбалансированное питание имеет множество преимуществ для здоровья и общего благополучия. Вот некоторые из них: 1. Поддержка здоровья: Сбалансированное питание обеспечивает организм всеми необходимыми питательными веществами, витаминами и минералами, что способствует поддержанию общего здоровья. 2. Управление весом: Правильное питание помогает контролировать вес, предотвращая как избыточный, так и недостаточный вес. 3. Улучшение пищеварения: Сбалансированное питание, богатое клетчаткой (овощи, фрукты, цельнозерновые продукты), способствует нормализации работы кишечника и предотвращает запоры. 4. Снижение риска хронических заболеваний: Правильное питание может снизить риск развития сердечно-сосудистых заболеваний, диабета 2 типа, некоторых видов рака и других хронических заболеваний. 5. Улучшение уровня энергии: Сбалансированное питание обеспечивает организм необходимыми калориями и питательными веществами, что способствует повышению уровня энергии и улучшению работоспособности. 6. Поддержка иммунной системы: Витамины и минералы, содержащиеся в сбалансированном питании, помогают укрепить иммунную систему и защитить организм от инфекций. 7. Улучшение состояния кожи и волос: Правильное питание способствует улучшению состояния кожи и волос, делая их более здоровыми и красивыми. 8. Поддержка психического здоровья: Некоторые исследования показывают, что сбалансированное питание может помочь улучшить настроение и снизить риск депрессии и тревожности. 9. Улучшение когнитивных функций: Питательные вещества, такие как омега-3 жирные кислоты, витамины группы B и антиоксиданты, могут поддерживать здоровье мозга и улучшать память и концентрацию. 10. Снижение уровня стресса: Правильное питание может помочь организму лучше справляться со стрессом и улучшить общее самочувствие. 11. Поддержка здоровья костей и зубов: Кальций и витамин D, содержащиеся в сбалансированном питании, важны для здоровья костей и зубов. 12. Улучшение сна: Некоторые продукты, такие как орехи, бананы и молочные продукты, могут способствовать улучшению качества сна. 13. Долголетие: Сбалансированное питание может способствовать увеличению продолжительности жизни и улучшению ее качества. Сбалансированное питание включает разнообразные продукты из всех групп: фрукты, овощи, цельнозерновые продукты, белок (мясо, рыба, бобовые) и здоровые жиры. Это помогает обеспечить организм всеми необходимыми веществами для поддержания здоровья и хорошего самочувствия.

# ChallengeHomeFoodMonthTitle
source: 30 Days of Healthy Home Cooking
ru: 30 дней здоровой домашней еды

# ChallengeHomeFoodMonthSubtitle
source: "30 days of cooking healthy food for yourself (give up on food orders and control your diet)"
ru: "30 дней готовь для себя здоровую пищу (откажись от заказной еды и контролируй свое питание)"

# ChallengeHomeFoodMonthDescription
source: Cooking healthy meals for yourself every day has many benefits for both your physical and mental health. Here are some of them: 1. Control over ingredients*: Cooking at home allows you to choose quality, fresh ingredients while avoiding the added sugars, salt, and preservatives that are often found in processed foods. 2. Reduced calories: Home-cooked meals are usually lower in calories than fast food or ready meals, which can help you manage your weight and maintain a healthy lifestyle. 3. Save money: Cooking at home can be more economical than regularly buying ready meals or going out to restaurants. 4. Increased dietary variety: Cooking at home allows you to experiment with different recipes and ingredients, which helps add variety to your diet and improves nutritional value. 5. Improved cooking skills: Cooking regularly helps you develop your cooking skills, which can boost your confidence and make cooking more enjoyable. 6. Health Support: Eating healthy, home-cooked meals can improve overall health, reducing the risk of chronic diseases like diabetes, heart disease, and obesity. 7. Improve Digestion: Cooking with fresh, natural ingredients can help improve digestion and nutrient absorption. 8. Reduce Stress: Cooking can be a relaxing and creative activity, which can help reduce stress and improve mood. 9. Support Mental Health: Cooking can be a way to express yourself and improve your mood, which can have a positive impact on mental health. 10. Build Healthy Habits: Preparing healthy meals regularly helps develop healthy eating habits that can last a lifetime. 11. Social Connections: Preparing and sharing meals with family and friends strengthens social bonds and creates positive memories. 12. Improved Sleep Quality: Eating healthy, home-cooked meals can help improve your sleep quality, especially if you avoid heavy, fatty meals before bed. 13. Reduced Fast Food Addiction: Cooking at home can help you reduce your intake of fast food and processed foods, which can have a positive impact on your health. 14. Enjoyment from the Process: Cooking can be enjoyable and rewarding, especially when you see the results of your efforts in the form of a delicious, healthy meal. Regularly preparing healthy meals for yourself is not only a way to take care of your health, but also an opportunity to develop your culinary skills, improve your mood, and strengthen your social connections.
ru: Приготовление здоровой еды для себя каждый день имеет много преимуществ, как для физического, так и для психического здоровья. Вот некоторые из них: 1. Контроль ингридиентов: Приготовление пищи дома позволяет вам выбирать качественные и свежие ингредиенты, избегая добавленных сахаров, соли и консервантов, которые часто содержатся в готовых продуктах. 2. Снижение калорийности: Домашняя еда обычно менее калорийна, чем фастфуд или готовые блюда - это помогает контролировать вес и поддерживать здоровый образ жизни. 3. Экономия денег: Приготовление пищи дома может быть более экономичным, чем регулярные покупки готовых блюд или посещение ресторанов. 4. Разнообразие рациона: Готовя еду самостоятельно, вы можете экспериментировать с различными рецептами и ингредиентами, что способствует разнообразию в рационе и улучшает его питательную ценность. 5. Улучшение навыков кулинарии: Регулярное приготовление пищи помогает развивать кулинарные навыки, что может повысить уверенность в себе и сделать процесс готовки более приятным. 6. Поддержка здоровья: Здоровая домашняя еда способствует улучшению общего состояния здоровья, снижая риск хронических заболеваний, таких как диабет, сердечно-сосудистые заболевания и ожирение. 7. Улучшение пищеварения: Приготовление пищи с использованием свежих и натуральных ингредиентов способствует лучшему пищеварению и усвоению питательных веществ. 8. Снижение стресса: Процесс приготовления пищи может быть расслабляющим и творческим занятием, что помогает снизить уровень стресса и улучшить настроение. 9. Поддержка психического здоровья: Занятие кулинарией может быть способом самовыражения и улучшения настроения, что положительно сказывается на психическом здоровье. 10. Формирование здоровых привычек: Регулярное приготовление здоровой пищи помогает развивать привычку к правильному питанию, что может сохраняться на протяжении всей жизни. 11. Социальные связи: Приготовление и совместное употребление еды с семьей и друзьями укрепляет социальные связи и создает положительные воспоминания. 12. Улучшение качества сн*: Здоровая домашняя еда может способствовать улучшению качества сна, особенно если вы избегаете тяжелой и жирной пищи перед сном. 13. Снижение зависимости от фастфуда: Приготовление пищи дома помогает уменьшить потребление фастфуда и обработанных продуктов, что положительно сказывается на здоровье. 14. Удовлетворение от процесса: Приготовление пищи может приносить удовольствие и удовлетворение, особенно когда вы видите результат своих усилий в виде вкусного и полезного блюда. Регулярное приготовление здоровой еды для себя — это не только способ заботиться о своем здоровье, но и возможность развивать кулинарные навыки, улучшать настроение и укреплять социальные связи.

# ChallengeExcercises15MinTitle
source: 15 minutes of exercise (30 days)
ru: 15 минут зарядки (30 дней)

# ChallengeExcercises15MinSubtitle
source: "Do exercises every morning for 15 minutes"
ru: "Делай зарядку каждое утро в течении 15 минут"

# ChallengeExcercises15MinDescription
source: Morning exercise has many benefits for your physical and mental health. Here are some of them: 1. Improved circulation: Morning exercise helps to activate your blood circulation, which helps to deliver oxygen and nutrients to your cells. 2. Increased energy: Physical activity in the morning helps to wake up your body and increase your energy levels for the day. 3. Improved mood: Exercise promotes the production of endorphins, which can improve your mood and reduce stress. 4. Increased productivity: Physical activity helps to improve your concentration and focus, which can help you be more productive throughout the day. 5. Boosts metabolism: Morning exercise activates your metabolism, which can help with weight management and improve digestion. 6. Strengthens the cardiovascular system: Regular physical activity helps to strengthen the heart and blood vessels, reducing the risk of cardiovascular disease. 7. Improved flexibility and mobility: Exercise helps improve joint flexibility and mobility, which is important for overall physical fitness. 8. Reduced anxiety: Physical activity helps reduce anxiety and stress, promoting overall mental well-being. 9. Forms a habit: Regular morning exercise helps establish a healthy habit that can have a positive impact on other aspects of your life. 10. Improves sleep: Physical activity in the morning can help improve the quality of sleep, as it helps regulate your biorhythms. 11. Strengthens the immune system: Regular exercise can help strengthen the immune system, which helps the body fight off infections. 12. Social connections: If you exercise in a group or with friends, it can strengthen social connections and increase motivation. Morning exercise is a great way to start the day on a positive note and prepare your body and mind for the challenges ahead.
ru: Утренняя зарядка приносит множество преимуществ для физического и психического здоровья. Вот некоторые из них: 1. Улучшение кровообращения: Утренняя зарядка способствует активизации кровообращения, что помогает доставлять кислород и питательные вещества к клеткам. 2. Повышение уровня энергии: Физическая активность по утрам помогает пробудить организм и повысить уровень энергии на весь день. 3. Улучшение настроения: Упражнения способствуют выработке эндорфинов, что может улучшить настроение и снизить уровень стресса. 4. Увеличение продуктивности: Физическая активность помогает улучшить концентрацию и внимание, что способствует повышению продуктивности в течение дня. 5. Стимуляция метаболизма: Утренняя зарядка активизирует обмен веществ, что может помочь в контроле веса и улучшении пищеварения. 6. Укрепление сердечно-сосудистой системы: Регулярные физические нагрузки способствуют укреплению сердца и сосудов, снижая риск сердечно-сосудистых заболеваний. 7. Улучшение гибкости и подвижности: Упражнения помогают улучшить гибкость суставов и подвижность, что важно для общего физического состояния. 8. Снижение уровня тревожности: Физическая активность помогает снизить уровень тревожности и стресса, способствуя общему психическому благополучию. 9. Формирование привычки: Регулярная утренняя зарядка помогает установить здоровую привычку, которая может положительно сказаться на других аспектах жизни. 10. Улучшение сна: Физическая активность в утренние часы может способствовать улучшению качества сна, так как помогает регулировать биоритмы. 11. Укрепление иммунной системы: Регулярные физические нагрузки могут способствовать укреплению иммунной системы, что помогает организму лучше справляться с инфекциями. 12. Социальные связи: Если вы занимаетесь зарядкой в группе или с друзьями, это может укрепить социальные связи и повысить мотивацию. Утренняя зарядка — это отличный способ начать день с позитивной ноты и подготовить тело и ум к предстоящим задачам.

# ChallengeDailyWalksTitle
source: Daily walks (30 days)
ru: Ежедневные прогулки (30 дней)

# ChallengeDailyWalksSubtitle
source: "Go for a walk every day for 30 minutes"
ru: "Выходи на прогулку каждый день на 30 минут"

# ChallengeDailyWalksDescription
source: Taking a 30-minute walk outside every day has many health and well-being benefits. Here are some of them: 1. Improved fitness: Regular walking helps strengthen your cardiovascular system, improve your endurance, and maintain a healthy level of physical activity. 2. Weight management: Walking helps burn calories, which helps control your weight and prevent excess fat accumulation. 3. Improved mood: Physical activity, including walking, releases endorphins, which helps improve your mood and reduce stress. 4. Reduced stress and anxiety: Walking outdoors helps you relax and reduces stress, which has a positive effect on your mental health. 5. Improved sleep quality: Regular physical activity, such as walking, can help improve the quality of your sleep and make it easier to fall asleep. 6. Strengthen your immune system: Physical activity helps strengthen your immune system, which helps your body better defend itself against infections. 7. Improved Digestion: Walking can help improve bowel movements and reduce the risk of constipation. 8. Supports Joint Health: Regular walking helps keep your joints flexible and mobile, which can reduce the risk of arthritis and other joint conditions. 9. Improved Circulation: Walking helps improve blood circulation, which can improve cardiovascular health. 10. Increased Energy: Physical activity can help boost energy levels and improve overall performance. 11. Social Connections: Walking can be a great way to connect with friends or family, which can help strengthen social connections. 12. Improved Concentration and Productivity: Walking outdoors can help improve concentration and productivity, especially if you work or study. 13. Connect with Nature: Walking outside allows you to enjoy nature, which can improve your overall well-being and reduce stress levels. 14. Develop an activity habit: Regular walking can help you develop a habit of physical activity, which can lead to a more active lifestyle overall. 15. Improve heart health: Walking can help lower blood pressure and cholesterol levels, which can improve heart health. Taking a daily walk outside is an easy and affordable way to stay healthy, improve your fitness, and improve your overall well-being.
ru: Ежедневные прогулки на улице по 30 минут имеют множество преимуществ для здоровья и общего благополучия. Вот некоторые из них: 1. Улучшение физической формы: Регулярные прогулки помогают укрепить сердечно-сосудистую систему, улучшить выносливость и поддерживать нормальный уровень физической активности. 2. Контроль веса: Прогулки способствуют сжиганию калорий, что помогает контролировать вес и предотвращать избыточное накопление жира. 3. Улучшение настроения: Физическая активность, включая прогулки, способствует выработке эндорфинов, что помогает улучшить настроение и снизить уровень стресса. 4. Снижение уровня стресса и тревожности: Прогулки на свежем воздухе помогают расслабиться и снизить уровень стресса, что положительно сказывается на психическом здоровье. 5. Улучшение качества сна: Регулярные физические нагрузки, такие как прогулки, могут способствовать улучшению качества сна и облегчению засыпания. 6. Укрепление иммунной системы: Физическая активность помогает укрепить иммунную систему, что способствует лучшей защите организма от инфекций. 7. Улучшение пищеварения: Прогулки могут способствовать улучшению работы кишечника и снижению риска запоров. 8. Поддержка здоровья суставов: Регулярные прогулки помогают поддерживать гибкость и подвижность суставов, что может снизить риск развития артрита и других заболеваний суставов. 9. Улучшение кровообращения: Прогулки способствуют улучшению кровообращения, что положительно сказывается на здоровье сердечно-сосудистой системы. 10. Увеличение уровня энергии: Физическая активность помогает повысить уровень энергии и улучшить общую работоспособность. 11. Социальные связи: Прогулки могут быть отличной возможностью для общения с друзьями или семьей, что способствует укреплению социальных связей. 12. Улучшение концентрации и продуктивности: Прогулки на свежем воздухе могут помочь улучшить концентрацию и продуктивность, особенно если вы работаете или учитесь. 13. Связь с природой: Прогулки на улице позволяют насладиться природой, что может улучшить общее самочувствие и снизить уровень стресса. 14. Развитие привычки к активности: Регулярные прогулки могут помочь сформировать привычку к физической активности, что может привести к более активному образу жизни в целом. 15. Улучшение здоровья сердца: Прогулки способствуют снижению артериального давления и уровня холестерина, что положительно сказывается на здоровье сердца. Ежедневные прогулки на улице — это простой и доступный способ поддерживать здоровье, улучшать физическую форму и общее самочувствие.

# ChallengeDailyCyclingTitle
source: BikeChallenge (30 days)
ru: ВелоЧеллендж (30 дней)

# ChallengeDailyCyclingSubtitle
source: "Ride your bike every day"
ru: "Катайся на велосипеде каждый день"
