Repository: iKorunny/LidaChallenges
Catalog: LidaChallenges/LidaChallenges/*.lproj/Localizable.strings
Languages: ru

# CategoriesTitle
source: Collections
ru: Подборки

# CategoriesHabbits
source: Habbits
ru: Привычки

# CategoriesCare
source: Care
ru: Уход

# CategoriesSport
source: Sport
ru: Спорт

# CategoriesHealth
source: Health
ru: Здоровье

# CategoriesEducation
source: Education
ru: Образование

# CategoriesGoodWorks
source: Good deeds
ru: Добрые дела

# CreateChallengeContinueButtonTitle
source: Continue
ru: Далее

# CreateChallengeActionTitle
source: Challenge constructor
ru: Конструктор челленджа

# RandomChallengeActionTitle
source: Pick a challenge
ru: Подобрать челлендж

# PopularChallengesActionTitle
source: Popular challenges
ru: Популярные челленджи

# CreatedChallengesActionTitle
source: Challenges created
ru: Созданные челленджи

# CompletedChallengesActionTitle
source: Completed challenges
ru: Пройденные челленджи

# MyChallengesLargeButtonTitle
source: My challenges
ru: Мои челленджи

# MyChallengesNoData
source: No data
ru: Нет данных

# CreateChallengeTitle
source: Challenge constructor
ru: Конструктор челленджа

# CreateChallengeNameFieldPlaceholder
source: Enter the challenge name ...
ru: Введите название челленджа ...

# CreateChallengeDaysCountPlaceholder
source: Number of days
ru: Количество дней

# CreateChallengeDaysCountHint
source: Enter a value between 1 and 365
ru: Введите значение от 1 до 365

# CreateChallengeRegularityPlaceholder
source: Regularity
ru: Регулярность

# CreateChallengeRegularityDaily
source: Daily
ru: Ежедневно

# CreateChallengeRegularityMonday
source: mon
ru: пн

# CreateChallengeRegularityTuesday
source: tue
ru: вт

# CreateChallengeRegularityWednesday
source: wed
ru: ср

# CreateChallengeRegularityThursday
source: thu
ru: чт

# CreateChallengeRegularityFriday
source: fri
ru: птн

# CreateChallengeRegularitySaturday
source: sat
ru: сб

# CreateChallengeRegularitySunday
source: sun
ru: вскр

# CreateChallengeInfoTitle
source: Created challenge
ru: Созданный челлендж

# CreateChallengeInfoSave
source: Save
ru: Сохранить

# CreateChallengeInfoPickImage
source: Select a picture
ru: Выбрать картинку

# CreateChallengeInfoPlaceholder
source: Describe ... (optional)
ru: Опишите ... (при желании)

# CreateChallengeImagePickerTitle
source: Select a picture
ru: Выбрать картинку

# CreateChallengeImagePickerChange
source: Change picture
ru: Изменить картинку

# CreateChallengeImagePickerGallery
source: Select from gallery
ru: Выбрать из галереи

# NoLibraryAccessAlertTitle
source: You have restricted access
ru: Вы ограничили доступ

# NoLibraryAccessAlertBody
source: Go to settings
ru: Перейдите в настройки

# AlertToSettingsButtonTitle
source: Settings
ru: Настройки

# AlertCancelButtonTitle
source: Cancel
ru: Отмена

# OpenedChallengeTitle
source: Challenge
ru: Челлендж

# OpenedChallengeStartButton
source: Start
ru: Начать

# CustomChallengeSectionTitle
source: Custom
ru: Созданные

# ChallengeInfoRegularityTitle
source: Regularity: %@
ru: Регулярность: %@

# ChallengeInfoRegularityDaily
source: Dauly
ru: Ежедневно

# ChallengeInfoRegularityMonday
source: Mon
ru: Пн

# ChallengeInfoRegularityTuesday
source: Tue
ru: Вт

# ChallengeInfoRegularityWednesday
source: Wed
ru: Ср

# ChallengeInfoRegularityThursday
source: Thu
ru: Чт

# ChallengeInfoRegularityFriday
source: Fri
ru: Птн

# ChallengeInfoRegularitySaturday
source: Sat
ru: Сб

# ChallengeInfoRegularitySunday
source: Sun
ru: Вскр

# MyChallengesActiveTitle
source: In progress
ru: Активные

# MyChallengesCompleteTitle
source: Completed
ru: Пройденные

# ChallengeNotePlaceholder
source: Note ...
ru: Заметки...

# ChallengeNextDayAvailableText
source: Next day will be available at %@
ru: Следующий день будет доступен %@

# NotificationReminderDefaultTitle
source: Reminder
ru: Напоминание

# NotificationReminderDefaultBody
source: Don't forget to check your challenges for today
ru: Не забудьте проверить Ваши челленджи на сегодня

# ChallengeEarlyWakeUpTitle
source: Early rise (30 days)
ru: Ранний подъем (30 дней)

# ChallengeEarlyWakeUpSubtitle
source: "Wake up every day before 7am"
ru: "Просыпайся каждый день до 7 утра"

# ChallengeEarlyWakeUpDescription
source: There are many benefits to waking up early: 1. Increased productivity: Early mornings often provide the opportunity to work in a quiet and focused manner, which increases efficiency. 2. Mornings are the best time to plan: Mornings are great for organizing your day’s tasks and setting priorities. 3. Calm and peaceful: Mornings can be calmer, which can help reduce stress and anxiety. 4. Improved fitness: Waking up early can help you get regular morning workouts, which can improve your health. 5. More time for breakfast: Allows you time to eat a full, healthy breakfast, which can improve your overall well-being. 6. Improved mental health: There is a link between waking up early and an improved mood, which can help you feel more positive about life. 7. Best time for self-improvement: You can find time to read, meditate, or do other healthy practices. Overall, waking up early can greatly improve your quality of life and well-being.
ru: Ранние подъёмы имеют множество преимуществ: 1. Увеличение продуктивности: Раннее утро часто дает возможность работать в тишине и сосредоточенности, что повышает эффективность. 2. Утро- это лучшее время для планирования: Утро подходит для организации задач на день и установки приоритетов. 3. Спокойствие и умиротворение: Утренние часы могут быть более спокойными, что способствует снижению стресса и беспокойства. 4. Улучшение физического состояния: Ранние подъемы могут способствовать регулярным утренним тренировкам, что положительно сказывается на здоровье. 5. Больше времени для завтрака: Позволяет уделить время полноценному и здоровому завтраку, который улучшает общее самочувствие. 6. Повышение психического здоровья: Существует связь между ранними подъемами и улучшением настроения, что способствует более позитивному восприятию жизни. 7. Лучшее время для самосовершенствования: Можно найти время для чтения, медитации или других полезных практик. В целом, ранние подъемы могут значительно улучшить качество жизни и самочувствие.

# ChallengeContrastShowerTitle
source: Contrast shower (30 days)
ru: Контрастный душ (30 дней)

# ChallengeContrastShowerSubtitle
source: "Take a contrast shower (pour cool water over yourself) every morning"
ru: "Принимай контрастный душ (обливайся прохладной водой) каждое утро"

# ChallengeContrastShowerDescription
source: Contrast showers have several benefits: 1. Improved circulation: Alternating between warm and cool water helps improve blood circulation, which helps deliver oxygen and nutrients to your cells. 2. Release of endorphins: Contrasting temperatures can stimulate the release of endorphins, which improves your mood and reduces stress. 3. Strengthen your immune system: Regular contrast showers help strengthen your immune system, helping your body fight infections more effectively. 4. Increased tone and energy: Cool water energizes your body, helps you wake up, and gives you energy for the day. 5. Improved skin: Contrast showers can improve your skin tone, making it firmer and healthier. 6. Relieve muscle tension: Alternating temperatures help relax your muscles and reduce tension after sleep. Overall, contrast showers are a great way to recharge your batteries and get ready for an active day!
ru: Контрастный душ имеет несколько преимуществ: 1. Улучшение циркуляции крови: Чередование теплой и прохладной воды способствует улучшению кровообращения, что помогает доставлять кислород и питательные вещества к клеткам. 2. Выброс эндорфинов: Контрастные температуры могут стимулировать выброс эндорфинов, что улучшает настроение и снижает стресс. 3. Укрепление иммунной системы: Регулярный контрастный душ способствуют укреплению иммунной системы, помогая организму более эффективно бороться с инфекциями. 4. Повышение тонуса и энергии: Прохладная вода активизирует организм, помогает проснуться и придаёт энергию на весь день. 5. Улучшение состояния кожи: Контрастный душ может улучшить тонус кожи, сделать её более упругой и здоровой. 6. Снятие мышечного напряжения: Чередование температуры помогает расслабить мышцы и уменьшить напряжение после сна. В целом, контрастный душ — это отличный способ зарядиться энергией и подготовиться к активному дню!

# ChallengeFruitsAndVegetablesTitle
source: Eat fresh fruits and vegetables (30 days)
ru: Кушай свежие фрукты и овощи (30 дней)

# ChallengeFruitsAndVegetablesSubtitle
source: "Add fresh fruits and vegetables to your diet every day"
ru: "Добавляй в свой рацион свежие фрукты и овощи каждый день"

# ChallengeFruitsAndVegetablesDescription
source: Adding fresh fruits and vegetables to your daily diet has many benefits: 1. Vitamins and minerals: Fruits and vegetables contain many essential vitamins and minerals that support immunity and overall health. 2. High in fiber: This promotes healthy digestion, helps prevent constipation, and maintains normal blood sugar levels. 3. Low in calories: Fruits and vegetables are generally low in calories, which helps with weight management and reduces the risk of obesity. 4. Antioxidants: Many fruits and vegetables contain antioxidants that fight inflammation and protect cells from damage. 5. Improved skin health: The vitamins and minerals in fruits and vegetables help improve the health and appearance of your skin. 6. Reduced risk of disease: Regular consumption of fruits and vegetables has been linked to a reduced risk of heart disease, diabetes, and certain cancers. 7. Energy Support: These foods provide essential nutrients to help maintain energy throughout the day. Including fresh fruits and vegetables in your diet is a simple and effective way to improve your overall health and well-being.
ru: Добавление свежих фруктов и овощей в ежедневный рацион приносит много пользы: 1. Богатство витаминов и минералов: Фрукты и овощи содержат множество необходимых витаминов и минералов, которые поддерживают иммунитет и общее здоровье. 2. Высокое содержание клетчатки: Это способствует здоровому пищеварению, помогает предотвратить запоры и поддерживает нормальный уровень сахара в крови. 3. Низкая калорийность: Фрукты и овощи обычно низкокалорийны, что помогает контролировать вес и снижает риск ожирения. 4. Антиоксиданты: Многие фрукты и овощи содержат антиоксиданты, которые борются с воспалениями и защищают клетки от повреждений. 5. Улучшение состояния кожи: Витамины и минералы в овощах и фруктах способствуют улучшению состояния кожи и её внешнему виду. 6. Снижение риска заболеваний: Регулярное употребление фруктов и овощей связано со снижением риска сердечно-сосудистых заболеваний, диабета и некоторых видов рака. 7. Поддержание энергии: Эти продукты обеспечивают организм необходимыми питательными веществами, способствуя поддержанию энергии в течение дня. Включение свежих фруктов и овощей в рацион — это простой и эффективный способ улучшить общее здоровье и благополучие.

# ChallengeDailyMeditationTitle
source: Meditations (30 days)
ru: Медитации (30 дней)

# ChallengeDailyMeditationSubtitle
source: "Meditate daily"
ru: "Медитируй ежедневно"

# ChallengeDailyMeditationDescription
source: There are many benefits to meditating daily: 1. Reduced Stress: Meditation helps relax the mind and body, reducing anxiety and stress. 2. Improved Focus: Regular practice can help improve focus and concentration, improving productivity. 3. Increased Emotional Well-Being: Meditation can help improve mood, promote a positive outlook on life, and reduce symptoms of depression. 4. Improved Sleep Quality: Regular meditation can help you relax and improve the quality of your sleep, promoting deeper rest. 5. Increased Self-Awareness: Meditation can help you become more aware of your thoughts and emotions, which can help you make more informed decisions. 6. Physical Health: Research shows that meditation can lower blood pressure, strengthen the immune system, and improve overall health. 7. Improved Relationships: Meditation practice can help you develop empathy and understanding, which can improve your relationships with others. Overall, daily meditation is a powerful tool for improving both mental and physical health.
ru: Ежедневные медитации приносят множество преимуществ: 1. Снижение стресса: Медитация помогает расслабить ум и тело, снижая уровень тревожности и стресса. 2. Улучшение концентрации: Регулярная практика способствует повышению внимания и концентрации, улучшая продуктивность. 3. Повышение эмоционального благополучия: Медитация помогает улучшить настроение, способствует позитивному восприятию жизни и снижает симптомы депрессии. 4. Улучшение качества сна: Регулярные медитации могут помочь расслабиться и улучшить качество сна, способствуя более глубокому отдыху. 5. Увеличение самосознания: Медитация способствует лучшему пониманию своих мыслей и эмоций, что помогает принимать более осознанные решения. 6. Физическое здоровье: Исследования показывают, что медитация может снижать кровяное давление, укреплять иммунную систему и улучшать общее состояние здоровья. 7. Улучшение отношений: Практика медитации способствует развитию эмпатии и понимания, что может улучшить взаимоотношения с окружающими. В целом, ежедневные медитации — это мощный инструмент для улучшения как психического, так и физического здоровья.

# ChallengeGoBedTitle
source: Go to bed before 11:00 PM (30 days)
ru: Ложиться спать до 23:00 (30 дней)

# ChallengeGoBedSubtitle
source: "Go to bed before 11:00 pm every day"
ru: "Ложись спать до 23:00 каждый день"

# ChallengeGoBedDescription
source: Going to bed before 11:00 PM has many benefits: 1. Improved sleep quality: Going to bed early promotes deeper, more restorative sleep as your body switches into rest mode more harmoniously. 2. Regulates your circadian rhythm: Going to bed at a consistent time every night helps maintain a stable biological clock, which improves your overall well-being. 3. Increases energy: Going to bed early allows your body to recover better, which gives you more energy and alertness the next day. 4. Improves mood: Getting enough sleep helps reduce stress levels and improves your mental and emotional state. 5. Increases productivity: Going to bed early improves cognitive functions such as memory, attention, and learning ability. 6. Maintains health: Regularly sleeping before midnight has been linked to a reduced risk of various diseases and disorders, such as cardiovascular problems and diabetes. Overall, getting adequate sleep before 11:00 pm can significantly improve your quality of life.
ru: Ложиться спать до 23:00 приносит множество преимуществ: 1. Улучшение качества сна: Ранний сон способствует более глубокому и восстанавливающему сну, так как тело гармоничнее переключается в режим отдыха. 2. Регуляция циркадного ритма: Ложась спать в одно и то же время, вы поддерживаете стабильные биологические часы, что улучшает общее самочувствие. 3. Повышение энергии: Ранний сон позволяет организму восстанавливаться лучше, что дает больше энергии и бодрствования на следующий день. 4. Улучшает настроение: Достаточный сон способствует снижению уровня стресса и улучшению психоэмоционального состояния. 5. Увеличение продуктивности: Ранний сон улучшает когнитивные функции, такие как память, внимание и способность к обучению. 6. Поддержание здоровья: Регулярный сон до полуночи связан с уменьшением риска различных заболеваний и нарушений, таких как сердечно-сосудистые проблемы и диабет. В целом, адекватный сон до 23:00 может существенно улучшить качество жизни.

# ChallengeNoPhoneMorningTitle
source: Morning without a phone (30 days)
ru: Утро без телефона (30 дней)

# ChallengeNoPhoneMorningSubtitle
source: "Don’t take your phone for the first 1 hour after waking up (set aside this time for yourself: a glass of water, exercise, a contrast shower, a delicious breakfast)"
ru: "Не бери телефон первый 1 час после пробуждения (выдели это время на себя: стакан воды, зарядка, контрастный душ, вкусный завтрак)"

# ChallengeNoPhoneMorningDescription
source: There are many benefits to spending your mornings without your phone: 1. Improved Focus: Without the distraction of notifications and social media, you can focus on important tasks or plans for the day. 2. Reduced Stress: A phone-free morning helps you avoid the stress of rapid information consumption and social interactions. 3. Increased Productivity: Instead of scrolling through the news or social media, you can use this time to meditate, exercise, or plan your day. 4. Better Mood: Taking a break from your screen in the morning improves your mental state and helps you start your day on a positive note. 5. Healthier: Reducing screen time reduces eye strain and promotes better physical health. 6. Habit Building: A phone-free morning allows you to create healthy morning habits, such as exercising, reading, or breakfast. Thus, a phone-free morning helps you start your day more harmoniously and productively.
ru: Проведение утра без телефона приносит множество преимуществ: 1. Улучшение фокуса: Без отвлечения на уведомления и социальные сети вы можете сосредоточиться на важных задачах или планах на день. 2. Снижение стресса: Утро без телефона помогает избежать стресса от быстрого потребления информации и социальных взаимодействий. 3. Повышение продуктивности: Вместо прокрутки новостей или соцсетей вы можете использовать это время для медитации, физической активности или планирования дня. 4. Лучшее настроение: Отдых от экрана в утренние часы способствует улучшению психоэмоционального состояния и помогает начать день на позитивной ноте. 5. Забота о здоровье: Уменьшение времени перед экраном снижает нагрузку на глаза и способствует лучшему физическому состоянию. 6. Формирование привычек: Утро без телефона позволяет создать полезные утренние привычки, такие как зарядка, чтение или завтрак. Таким образом, утро без телефона способствует более гармоничному и продуктивному началу дня.

# ChallengeFaceMassageTitle
source: Facial massage (30 days)
ru: Массаж лица (30 дней)

# ChallengeFaceMassageSubtitle
source: "Do a facial massage every morning or evening"
ru: "Делай массаж для лица каждое утро или вечер"

# ChallengeFaceMassageDescription
source: Daily facial massage has many benefits: 1. Improved circulation: Stimulating the skin increases blood flow, which promotes a healthier complexion and improved metabolism. 2. Tension relief: Massage helps to relax the facial muscles, reducing tension and stress, which in turn can reduce the appearance of wrinkles. 3. Lifting effect: Regular massage helps to tighten the skin and improve the contours of the face, making it firmer and more youthful. 4. Improved skin tone: Tissue stimulation promotes a more even tone and texture of the skin, and improves its elasticity. 5. Reduces puffiness: Massage helps to reduce puffiness and bags under the eyes, improving the overall appearance. 6. Relaxation and well-being: The massage process promotes relaxation not only physically but also emotionally, improving overall well-being. Daily facial massage can be a great addition to your skin care routine and improve the quality of your life.
ru: Ежедневный массаж лица приносит много преимуществ: 1. Улучшение кровообращения: Стимуляция кожи увеличивает приток крови, что способствует более здоровому цвету лица и улучшению обмена веществ. 2. Снятие напряжения: Массаж помогает расслабить мышцы лица, снизить напряжение и стресс, что в свою очередь может уменьшить проявление морщин. 3. Лифтинг-эффект: Регулярный массаж помогает подтянуть кожу и улучшить контуры лица, делая его более упругим и молодым. 4. Улучшение тонуса кожи: Стимуляция тканей способствует более равномерному тону и текстуре кожи, а также улучшает ее эластичность. 5. Снятие отечности: Массаж помогает уменьшить отеки и мешки под глазами, улучшая общий внешний вид. 6. Релаксация и улучшение самочувствия: Процесс массажа способствует расслаблению не только физическому, но и эмоциональному, улучшая общее самочувствие. Ежедневный массаж лица может стать отличным дополнением к уходу за кожей и улучшить качество вашей жизни.

# ChallengeLymphoMassageTitle
source: Lymphatic drainage massage for the body (30 days)
ru: Лимфодренажный массаж для тела (30 дней)

# ChallengeLymphoMassageSubtitle
source: "Do lymphatic drainage massage for your body every day"
ru: "Делай лимфодренажный массаж для тела каждый день"

# ChallengeLymphoMassageDescription
source: Daily lymphatic drainage massage of the body brings many benefits: 1. Improved lymphatic flow: Stimulation of the lymphatic system helps to effectively remove toxins and excess fluid from the body. 2. Reduced swelling: Massage helps to reduce swelling, especially in problem areas such as the legs and ankles. 3. Stimulated circulation: Improves blood flow to tissues, which promotes overall health and improved skin texture. 4. Improved skin condition: Regular massage helps to improve skin elasticity and smoothness, as well as reduce the appearance of cellulite. 5. Reduced stress and tension: Lymphatic drainage massage promotes relaxation, which helps to reduce stress levels and improve overall well-being. 6. Boost metabolism: Helps to activate metabolism, which can promote weight management and improve metabolism. Thus, daily lymphatic drainage massage is an effective way to maintain health and improve quality of life.
ru: Ежедневный лимфодренажный массаж тела приносит много преимуществ: 1. Улучшение лимфооттока: Стимуляция лимфатической системы помогает эффективно удалять токсины и лишнюю жидкость из организма. 2. Снижение отечности: Массаж помогает уменьшить отеки, особенно в проблемных зонах, таких как ноги и лодыжки. 3. Стимуляция кровообращения: Улучшает кровоснабжение тканей, что способствует общему оздоровлению и улучшению структуры кожи. 4. Улучшение состояния кожи: Регулярный массаж способствует повышению упругости кожи и ее гладкости, а также снижению проявления целлюлита. 5. Снижение стресса и напряжения: Лимфодренажный массаж способствует расслаблению, что помогает уменьшить уровень стресса и улучшает общее самочувствие. 6. Ускорение обмена веществ: Помогает активизировать метаболизм, что может способствовать контролю веса и улучшению обмена веществ. Таким образом, ежедневный лимфодренажный массаж является эффективным способом поддержания здоровья и улучшения качества жизни.

# ChallengeFaceSerumTitle
source: Face Serum Course (30 days)
ru: Курс сыворотки для лица (30 дней)

# ChallengeFaceSerumSubtitle
source: "Apply the serum to your face daily"
ru: "Наноси сыворотку на кожу лица ежедневно"
